Autodesk.Revit.DB.LeaderStartCondition
Since:
2027
An enumerated type listing leader start conditions that are supported for tags.
Remarks:
The leader start is the point on the leader that is closest to the tag head.
Since:
2027

Autodesk.Revit.DB.LeaderStartCondition.Free
The leader start point can be freely positioned by the user.

Autodesk.Revit.DB.LeaderStartCondition.Attached
Revit automatically keeps the leader start point attached to the tag head.